{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "name" : "input0.3",
      "weights" : {

      },
      "dst_w" : 512,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 512,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "input",
      "debug_info" : "input0.3",
      "dst_seq" : 1,
      "dst_k" : 3,
      "top" : "input0.3"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.47",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "input.47",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "input.47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input0.3",
      "weights" : {

      },
      "Nx" : 6,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 6,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "bottom" : "input.47",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "79__silu_sigmoid__",
      "top" : "79__silu_sigmoid__",
      "type" : "activation",
      "name" : "79__silu_sigmoid__"
    },
    {
      "bottom" : "input.47,79__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "79",
      "top" : "79",
      "type" : "elementwise",
      "name" : "79",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.21",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.21",
      "K" : 16,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "input.21",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "79",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "bottom" : "input.21",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "88__silu_sigmoid__",
      "top" : "88__silu_sigmoid__",
      "type" : "activation",
      "name" : "88__silu_sigmoid__"
    },
    {
      "bottom" : "input.21,88__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "88",
      "top" : "88",
      "type" : "elementwise",
      "name" : "88",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.19",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.19",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "input.19",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "88",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "bottom" : "input.19",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "101__silu_sigmoid__",
      "top" : "101__silu_sigmoid__",
      "type" : "activation",
      "name" : "101__silu_sigmoid__"
    },
    {
      "bottom" : "input.19,101__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "101",
      "top" : "101",
      "type" : "elementwise",
      "name" : "101",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.49",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.49",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "input.49",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "101",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "bottom" : "input.49",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "115__silu_sigmoid__",
      "top" : "115__silu_sigmoid__",
      "type" : "activation",
      "name" : "115__silu_sigmoid__"
    },
    {
      "bottom" : "input.49,115__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "115",
      "top" : "115",
      "type" : "elementwise",
      "name" : "115",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.51",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.51",
      "K" : 32,
      "blob_biases" : 17,
      "name" : "input.51",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "115",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "bottom" : "input.51",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "124__silu_sigmoid__",
      "top" : "124__silu_sigmoid__",
      "type" : "activation",
      "name" : "124__silu_sigmoid__"
    },
    {
      "bottom" : "input.51,124__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "124",
      "top" : "124",
      "type" : "elementwise",
      "name" : "124",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.27",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.27",
      "K" : 32,
      "blob_biases" : 21,
      "name" : "input.27",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "124",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "bottom" : "input.27",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "133__silu_sigmoid__",
      "top" : "133__silu_sigmoid__",
      "type" : "activation",
      "name" : "133__silu_sigmoid__"
    },
    {
      "bottom" : "input.27,133__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "133",
      "top" : "133",
      "type" : "elementwise",
      "name" : "133",
      "beta" : 0
    },
    {
      "bottom" : "101,133",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "134",
      "top" : "134",
      "type" : "elementwise",
      "name" : "134",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.53",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.53",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "input.53",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "88",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "bottom" : "input.53",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "143__silu_sigmoid__",
      "top" : "143__silu_sigmoid__",
      "type" : "activation",
      "name" : "143__silu_sigmoid__"
    },
    {
      "bottom" : "input.53,143__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "143",
      "top" : "143",
      "type" : "elementwise",
      "name" : "143",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.31",
      "top" : "input.31",
      "type" : "concat",
      "name" : "input.31",
      "bottom" : "134,143"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.2",
      "K" : 32,
      "blob_biases" : 29,
      "name" : "input0.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.31",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "bottom" : "input0.2",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "154__silu_sigmoid__",
      "top" : "154__silu_sigmoid__",
      "type" : "activation",
      "name" : "154__silu_sigmoid__"
    },
    {
      "bottom" : "input0.2,154__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "154",
      "top" : "154",
      "type" : "elementwise",
      "name" : "154",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.23",
      "K" : 32,
      "blob_biases" : 33,
      "name" : "input.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "154",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "input.23",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "166__silu_sigmoid__",
      "top" : "166__silu_sigmoid__",
      "type" : "activation",
      "name" : "166__silu_sigmoid__"
    },
    {
      "bottom" : "input.23,166__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "166",
      "top" : "166",
      "type" : "elementwise",
      "name" : "166",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.25",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.25",
      "K" : 64,
      "blob_biases" : 37,
      "stride_x" : 2,
      "name" : "input.25",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "166",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "bottom" : "input.25",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "175__silu_sigmoid__",
      "top" : "175__silu_sigmoid__",
      "type" : "activation",
      "name" : "175__silu_sigmoid__"
    },
    {
      "bottom" : "input.25,175__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "175",
      "top" : "175",
      "type" : "elementwise",
      "name" : "175",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.29",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.29",
      "K" : 64,
      "blob_biases" : 41,
      "name" : "input.29",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "175",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "bottom" : "input.29",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "184__silu_sigmoid__",
      "top" : "184__silu_sigmoid__",
      "type" : "activation",
      "name" : "184__silu_sigmoid__"
    },
    {
      "bottom" : "input.29,184__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "184",
      "top" : "184",
      "type" : "elementwise",
      "name" : "184",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.39",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.39",
      "K" : 64,
      "blob_biases" : 45,
      "name" : "input.39",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "184",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "bottom" : "input.39",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "197__silu_sigmoid__",
      "top" : "197__silu_sigmoid__",
      "type" : "activation",
      "name" : "197__silu_sigmoid__"
    },
    {
      "bottom" : "input.39,197__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "197",
      "top" : "197",
      "type" : "elementwise",
      "name" : "197",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.41",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.41",
      "K" : 32,
      "blob_biases" : 49,
      "name" : "input.41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "197",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "bottom" : "input.41",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "212__silu_sigmoid__",
      "top" : "212__silu_sigmoid__",
      "type" : "activation",
      "name" : "212__silu_sigmoid__"
    },
    {
      "bottom" : "input.41,212__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "212",
      "top" : "212",
      "type" : "elementwise",
      "name" : "212",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.43",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.43",
      "K" : 64,
      "blob_biases" : 53,
      "name" : "input.43",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "212",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "bottom" : "input.43",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "221__silu_sigmoid__",
      "top" : "221__silu_sigmoid__",
      "type" : "activation",
      "name" : "221__silu_sigmoid__"
    },
    {
      "bottom" : "input.43,221__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "221",
      "top" : "221",
      "type" : "elementwise",
      "name" : "221",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.45",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.45",
      "K" : 64,
      "blob_biases" : 57,
      "name" : "input.45",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "221",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "input.45",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "230__silu_sigmoid__",
      "top" : "230__silu_sigmoid__",
      "type" : "activation",
      "name" : "230__silu_sigmoid__"
    },
    {
      "bottom" : "input.45,230__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "230",
      "top" : "230",
      "type" : "elementwise",
      "name" : "230",
      "beta" : 0
    },
    {
      "bottom" : "197,230",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.55",
      "top" : "input.55",
      "type" : "elementwise",
      "name" : "input.55",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.33",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.33",
      "K" : 32,
      "blob_biases" : 61,
      "name" : "input.33",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.55",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "bottom" : "input.33",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "244__silu_sigmoid__",
      "top" : "244__silu_sigmoid__",
      "type" : "activation",
      "name" : "244__silu_sigmoid__"
    },
    {
      "bottom" : "input.33,244__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "244",
      "top" : "244",
      "type" : "elementwise",
      "name" : "244",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.35",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.35",
      "K" : 64,
      "blob_biases" : 65,
      "name" : "input.35",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "244",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "bottom" : "input.35",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "253__silu_sigmoid__",
      "top" : "253__silu_sigmoid__",
      "type" : "activation",
      "name" : "253__silu_sigmoid__"
    },
    {
      "bottom" : "input.35,253__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "253",
      "top" : "253",
      "type" : "elementwise",
      "name" : "253",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.61",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.61",
      "K" : 64,
      "blob_biases" : 69,
      "name" : "input.61",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "253",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "bottom" : "input.61",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "262__silu_sigmoid__",
      "top" : "262__silu_sigmoid__",
      "type" : "activation",
      "name" : "262__silu_sigmoid__"
    },
    {
      "bottom" : "input.61,262__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "262",
      "top" : "262",
      "type" : "elementwise",
      "name" : "262",
      "beta" : 0
    },
    {
      "bottom" : "input.55,262",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "263",
      "top" : "263",
      "type" : "elementwise",
      "name" : "263",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.37",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.37",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "input.37",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "184",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "bottom" : "input.37",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "272__silu_sigmoid__",
      "top" : "272__silu_sigmoid__",
      "type" : "activation",
      "name" : "272__silu_sigmoid__"
    },
    {
      "bottom" : "input.37,272__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "272",
      "top" : "272",
      "type" : "elementwise",
      "name" : "272",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.65",
      "top" : "input.65",
      "type" : "concat",
      "name" : "input.65",
      "bottom" : "263,272"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.4",
      "K" : 64,
      "blob_biases" : 77,
      "name" : "input0.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.65",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "bottom" : "input0.4",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "283__silu_sigmoid__",
      "top" : "283__silu_sigmoid__",
      "type" : "activation",
      "name" : "283__silu_sigmoid__"
    },
    {
      "bottom" : "input0.4,283__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "283",
      "top" : "283",
      "type" : "elementwise",
      "name" : "283",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.57",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.57",
      "K" : 64,
      "blob_biases" : 81,
      "name" : "input.57",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "283",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "input.57",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "295__silu_sigmoid__",
      "top" : "295__silu_sigmoid__",
      "type" : "activation",
      "name" : "295__silu_sigmoid__"
    },
    {
      "bottom" : "input.57,295__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "295",
      "top" : "295",
      "type" : "elementwise",
      "name" : "295",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.59",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.59",
      "K" : 128,
      "blob_biases" : 85,
      "stride_x" : 2,
      "name" : "input.59",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "295",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "bottom" : "input.59",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "304__silu_sigmoid__",
      "top" : "304__silu_sigmoid__",
      "type" : "activation",
      "name" : "304__silu_sigmoid__"
    },
    {
      "bottom" : "input.59,304__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "304",
      "top" : "304",
      "type" : "elementwise",
      "name" : "304",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.63",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.63",
      "K" : 128,
      "blob_biases" : 89,
      "name" : "input.63",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "304",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "bottom" : "input.63",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "313__silu_sigmoid__",
      "top" : "313__silu_sigmoid__",
      "type" : "activation",
      "name" : "313__silu_sigmoid__"
    },
    {
      "bottom" : "input.63,313__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "313",
      "top" : "313",
      "type" : "elementwise",
      "name" : "313",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.73",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.73",
      "K" : 128,
      "blob_biases" : 93,
      "name" : "input.73",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "313",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "input.73",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "326__silu_sigmoid__",
      "top" : "326__silu_sigmoid__",
      "type" : "activation",
      "name" : "326__silu_sigmoid__"
    },
    {
      "bottom" : "input.73,326__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "326",
      "top" : "326",
      "type" : "elementwise",
      "name" : "326",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.5",
      "K" : 64,
      "blob_biases" : 97,
      "name" : "input.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "326",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "bottom" : "input.5",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "342__silu_sigmoid__",
      "top" : "342__silu_sigmoid__",
      "type" : "activation",
      "name" : "342__silu_sigmoid__"
    },
    {
      "bottom" : "input.5,342__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "342",
      "top" : "342",
      "type" : "elementwise",
      "name" : "342",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.7",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.7",
      "K" : 128,
      "blob_biases" : 101,
      "name" : "input.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "342",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "bottom" : "input.7",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "351__silu_sigmoid__",
      "top" : "351__silu_sigmoid__",
      "type" : "activation",
      "name" : "351__silu_sigmoid__"
    },
    {
      "bottom" : "input.7,351__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "351",
      "top" : "351",
      "type" : "elementwise",
      "name" : "351",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.9",
      "K" : 128,
      "blob_biases" : 105,
      "name" : "input.9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "351",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "bottom" : "input.9",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "360__silu_sigmoid__",
      "top" : "360__silu_sigmoid__",
      "type" : "activation",
      "name" : "360__silu_sigmoid__"
    },
    {
      "bottom" : "input.9,360__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "360",
      "top" : "360",
      "type" : "elementwise",
      "name" : "360",
      "beta" : 0
    },
    {
      "bottom" : "326,360",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.11",
      "top" : "input.11",
      "type" : "elementwise",
      "name" : "input.11",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.13",
      "K" : 64,
      "blob_biases" : 109,
      "name" : "input.13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.11",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "bottom" : "input.13",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "374__silu_sigmoid__",
      "top" : "374__silu_sigmoid__",
      "type" : "activation",
      "name" : "374__silu_sigmoid__"
    },
    {
      "bottom" : "input.13,374__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "374",
      "top" : "374",
      "type" : "elementwise",
      "name" : "374",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.15",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.15",
      "K" : 128,
      "blob_biases" : 113,
      "name" : "input.15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "374",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "bottom" : "input.15",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "383__silu_sigmoid__",
      "top" : "383__silu_sigmoid__",
      "type" : "activation",
      "name" : "383__silu_sigmoid__"
    },
    {
      "bottom" : "input.15,383__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "383",
      "top" : "383",
      "type" : "elementwise",
      "name" : "383",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.17",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.17",
      "K" : 128,
      "blob_biases" : 117,
      "name" : "input.17",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "383",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "input.17",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "392__silu_sigmoid__",
      "top" : "392__silu_sigmoid__",
      "type" : "activation",
      "name" : "392__silu_sigmoid__"
    },
    {
      "bottom" : "input.17,392__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "392",
      "top" : "392",
      "type" : "elementwise",
      "name" : "392",
      "beta" : 0
    },
    {
      "bottom" : "input.11,392",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3",
      "top" : "input.3",
      "type" : "elementwise",
      "name" : "input.3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.67",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.67",
      "K" : 64,
      "blob_biases" : 121,
      "name" : "input.67",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "bottom" : "input.67",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "406__silu_sigmoid__",
      "top" : "406__silu_sigmoid__",
      "type" : "activation",
      "name" : "406__silu_sigmoid__"
    },
    {
      "bottom" : "input.67,406__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "406",
      "top" : "406",
      "type" : "elementwise",
      "name" : "406",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.69",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.69",
      "K" : 128,
      "blob_biases" : 125,
      "name" : "input.69",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "406",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "bottom" : "input.69",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "415__silu_sigmoid__",
      "top" : "415__silu_sigmoid__",
      "type" : "activation",
      "name" : "415__silu_sigmoid__"
    },
    {
      "bottom" : "input.69,415__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "415",
      "top" : "415",
      "type" : "elementwise",
      "name" : "415",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.79",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.79",
      "K" : 128,
      "blob_biases" : 129,
      "name" : "input.79",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "415",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "bottom" : "input.79",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "424__silu_sigmoid__",
      "top" : "424__silu_sigmoid__",
      "type" : "activation",
      "name" : "424__silu_sigmoid__"
    },
    {
      "bottom" : "input.79,424__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "424",
      "top" : "424",
      "type" : "elementwise",
      "name" : "424",
      "beta" : 0
    },
    {
      "bottom" : "input.3,424",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "425",
      "top" : "425",
      "type" : "elementwise",
      "name" : "425",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.71",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.71",
      "K" : 128,
      "blob_biases" : 133,
      "name" : "input.71",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "313",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "bottom" : "input.71",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "434__silu_sigmoid__",
      "top" : "434__silu_sigmoid__",
      "type" : "activation",
      "name" : "434__silu_sigmoid__"
    },
    {
      "bottom" : "input.71,434__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "434",
      "top" : "434",
      "type" : "elementwise",
      "name" : "434",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.83",
      "top" : "input.83",
      "type" : "concat",
      "name" : "input.83",
      "bottom" : "425,434"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.6",
      "K" : 128,
      "blob_biases" : 137,
      "name" : "input0.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.83",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "bottom" : "input0.6",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "445__silu_sigmoid__",
      "top" : "445__silu_sigmoid__",
      "type" : "activation",
      "name" : "445__silu_sigmoid__"
    },
    {
      "bottom" : "input0.6,445__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "445",
      "top" : "445",
      "type" : "elementwise",
      "name" : "445",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.75",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.75",
      "K" : 128,
      "blob_biases" : 141,
      "name" : "input.75",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "445",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "bottom" : "input.75",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "457__silu_sigmoid__",
      "top" : "457__silu_sigmoid__",
      "type" : "activation",
      "name" : "457__silu_sigmoid__"
    },
    {
      "bottom" : "input.75,457__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "457",
      "top" : "457",
      "type" : "elementwise",
      "name" : "457",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.77",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.77",
      "K" : 256,
      "blob_biases" : 145,
      "stride_x" : 2,
      "name" : "input.77",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "457",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "input.77",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "466__silu_sigmoid__",
      "top" : "466__silu_sigmoid__",
      "type" : "activation",
      "name" : "466__silu_sigmoid__"
    },
    {
      "bottom" : "input.77,466__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "466",
      "top" : "466",
      "type" : "elementwise",
      "name" : "466",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.81",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.81",
      "K" : 256,
      "blob_biases" : 149,
      "name" : "input.81",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "466",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "bottom" : "input.81",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "475__silu_sigmoid__",
      "top" : "475__silu_sigmoid__",
      "type" : "activation",
      "name" : "475__silu_sigmoid__"
    },
    {
      "bottom" : "input.81,475__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "475",
      "top" : "475",
      "type" : "elementwise",
      "name" : "475",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.97",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.97",
      "K" : 256,
      "blob_biases" : 153,
      "name" : "input.97",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "475",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "bottom" : "input.97",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "488__silu_sigmoid__",
      "top" : "488__silu_sigmoid__",
      "type" : "activation",
      "name" : "488__silu_sigmoid__"
    },
    {
      "bottom" : "input.97,488__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "488",
      "top" : "488",
      "type" : "elementwise",
      "name" : "488",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.91",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.91",
      "K" : 128,
      "blob_biases" : 157,
      "name" : "input.91",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "488",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "bottom" : "input.91",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "502__silu_sigmoid__",
      "top" : "502__silu_sigmoid__",
      "type" : "activation",
      "name" : "502__silu_sigmoid__"
    },
    {
      "bottom" : "input.91,502__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "502",
      "top" : "502",
      "type" : "elementwise",
      "name" : "502",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.85",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.85",
      "K" : 256,
      "blob_biases" : 161,
      "name" : "input.85",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "502",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "bottom" : "input.85",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "511__silu_sigmoid__",
      "top" : "511__silu_sigmoid__",
      "type" : "activation",
      "name" : "511__silu_sigmoid__"
    },
    {
      "bottom" : "input.85,511__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "511",
      "top" : "511",
      "type" : "elementwise",
      "name" : "511",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.103",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.103",
      "K" : 256,
      "blob_biases" : 165,
      "name" : "input.103",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "511",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "bottom" : "input.103",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "520__silu_sigmoid__",
      "top" : "520__silu_sigmoid__",
      "type" : "activation",
      "name" : "520__silu_sigmoid__"
    },
    {
      "bottom" : "input.103,520__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "520",
      "top" : "520",
      "type" : "elementwise",
      "name" : "520",
      "beta" : 0
    },
    {
      "bottom" : "488,520",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "521",
      "top" : "521",
      "type" : "elementwise",
      "name" : "521",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.89",
      "pad_fill_mode" : 0,
