{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_1_output",
      "K" : 4,
      "blob_biases" : 1,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "bottom" : "batch_normalization_1_output",
      "weights" : {
        "params_prelu" : 5
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_1",
      "top" : "p_re_lu_1_output",
      "type" : "activation",
      "name" : "p_re_lu_1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_2_output",
      "K" : 16,
      "blob_biases" : 7,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "p_re_lu_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 9
    },
    {
      "bottom" : "batch_normalization_2_output",
      "weights" : {
        "params_prelu" : 11
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_2",
      "top" : "p_re_lu_2_output",
      "type" : "activation",
      "name" : "p_re_lu_2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3_output",
      "K" : 24,
      "blob_biases" : 13,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "p_re_lu_2_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "bottom" : "p_re_lu_1_output,conv2d_3_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_1",
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_3_output",
      "K" : 16,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "add_1_output",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "bottom" : "batch_normalization_3_output",
      "weights" : {
        "params_prelu" : 21
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_3",
      "top" : "p_re_lu_3_output",
      "type" : "activation",
      "name" : "p_re_lu_3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_4_output",
      "K" : 8,
      "blob_biases" : 23,
      "name" : "conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "p_re_lu_3_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 25
    },
    {
      "bottom" : "batch_normalization_4_output",
      "weights" : {
        "params_prelu" : 27
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_4",
      "top" : "p_re_lu_4_output",
      "type" : "activation",
      "name" : "p_re_lu_4"
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 4,
      "top" : "max_pooling2d_1_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "p_re_lu_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 4,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_5_output",
      "K" : 24,
      "blob_biases" : 29,
      "name" : "conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_1_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "bottom" : "batch_normalization_5_output",
      "weights" : {
        "params_prelu" : 33
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_5",
      "top" : "p_re_lu_5_output",
      "type" : "activation",
      "name" : "p_re_lu_5"
    },
    {
      "pad_r" : 0,
      "debug_info" : "average_pooling2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 4,
      "top" : "average_pooling2d_1_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "average_pooling2d_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "p_re_lu_5_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 4,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_6_output",
      "K" : 32,
      "blob_biases" : 35,
      "name" : "conv2d_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "average_pooling2d_1_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 37
    },
    {
      "bottom" : "batch_normalization_6_output",
      "weights" : {
        "params_prelu" : 39
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_6",
      "top" : "p_re_lu_6_output",
      "type" : "activation",
      "name" : "p_re_lu_6"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_7_output",
      "K" : 32,
      "blob_biases" : 41,
      "name" : "depthwise_conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "p_re_lu_6_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "bottom" : "batch_normalization_7_output",
      "weights" : {
        "params_prelu" : 45
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_7",
      "top" : "p_re_lu_7_output",
      "type" : "activation",
      "name" : "p_re_lu_7"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_1",
      "top" : "concatenate_1_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_1",
      "bottom" : "p_re_lu_6_output,p_re_lu_7_output"
    },
    {
      "bottom" : "concatenate_1_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "concatenate_1",
      "top" : "concatenate_1_output",
      "type" : "activation",
      "name" : "concatenate_1__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_8_output",
      "K" : 64,
      "blob_biases" : 47,
      "name" : "conv2d_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "concatenate_1_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 49
    },
    {
      "bottom" : "batch_normalization_8_output",
      "weights" : {
        "params_prelu" : 51
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_8",
      "top" : "p_re_lu_8_output",
      "type" : "activation",
      "name" : "p_re_lu_8"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_2",
      "top" : "concatenate_2_output",
      "type" : "concat",
      "name" : "concatenate_2",
      "bottom" : "concatenate_1_output,p_re_lu_8_output"
    },
    {
      "pad_r" : 0,
      "debug_info" : "average_pooling2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 4,
      "top" : "average_pooling2d_2_output__tmp__identity__",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "average_pooling2d_2",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "concatenate_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 4,
      "pad_value" : 0
    },
    {
      "bottom" : "average_pooling2d_2_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "average_pooling2d_2",
      "top" : "average_pooling2d_2_output",
      "type" : "activation",
      "name" : "average_pooling2d_2__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_9_output",
      "K" : 72,
      "blob_biases" : 53,
      "name" : "conv2d_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "average_pooling2d_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "bottom" : "batch_normalization_9_output",
      "weights" : {
        "params_prelu" : 57
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_9",
      "top" : "p_re_lu_9_output",
      "type" : "activation",
      "name" : "p_re_lu_9"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_3",
      "top" : "concatenate_3_output__tmp__identity__",
      "type" : "concat",
      "name" : "concatenate_3",
      "bottom" : "average_pooling2d_2_output,p_re_lu_9_output"
    },
    {
      "bottom" : "concatenate_3_output__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "concatenate_3",
      "top" : "concatenate_3_output",
      "type" : "activation",
      "name" : "concatenate_3__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_10_output",
      "K" : 104,
      "blob_biases" : 59,
      "name" : "conv2d_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "concatenate_3_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 61
    },
    {
      "bottom" : "batch_normalization_10_output",
      "weights" : {
        "params_prelu" : 63
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_10",
      "top" : "p_re_lu_10_output",
      "type" : "activation",
      "name" : "p_re_lu_10"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_4",
      "top" : "concatenate_4_output",
      "type" : "concat",
      "name" : "concatenate_4",
      "bottom" : "concatenate_3_output,p_re_lu_10_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_11_output",
      "K" : 128,
      "blob_biases" : 65,
      "name" : "conv2d_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "concatenate_4_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "bottom" : "batch_normalization_11_output",
      "weights" : {
        "params_prelu" : 69
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_11",
      "top" : "p_re_lu_11_output",
      "type" : "activation",
      "name" : "p_re_lu_11"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_12_output",
      "K" : 24,
      "blob_biases" : 71,
      "name" : "depthwise_conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "p_re_lu_11_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 73
    },
    {
      "bottom" : "batch_normalization_12_output",
      "weights" : {
        "params_prelu" : 75
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_12",
      "top" : "p_re_lu_12_output",
      "type" : "activation",
      "name" : "p_re_lu_12"
    },
    {
      "bottom" : "p_re_lu_11_output,p_re_lu_12_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_2",
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_12_output",
      "K" : 72,
      "blob_biases" : 77,
      "name" : "conv2d_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "average_pooling2d_2_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "bottom" : "add_2_output,conv2d_12_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_3",
      "top" : "add_3_output",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_13_output",
      "K" : 24,
      "blob_biases" : 81,
      "name" : "depthwise_conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "add_3_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "batch_normalization_13_output",
      "weights" : {
        "params_prelu" : 85
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_13",
      "top" : "p_re_lu_13_output",
      "type" : "activation",
      "name" : "p_re_lu_13"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_14_output",
      "K" : 24,
      "blob_biases" : 87,
      "name" : "depthwise_conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "p_re_lu_13_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 89
    },
    {
      "bottom" : "batch_normalization_14_output",
      "weights" : {
        "params_prelu" : 91
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_14",
      "top" : "p_re_lu_14_output",
      "type" : "activation",
      "name" : "p_re_lu_14"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_5",
      "top" : "concatenate_5_output",
      "type" : "concat",
      "name" : "concatenate_5",
      "bottom" : "p_re_lu_13_output,p_re_lu_14_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_15_output",
      "K" : 48,
      "blob_biases" : 93,
      "name" : "depthwise_conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "concatenate_5_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "batch_normalization_15_output",
      "weights" : {
        "params_prelu" : 97
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_15",
      "top" : "p_re_lu_15_output",
      "type" : "activation",
      "name" : "p_re_lu_15"
    },
    {
      "bottom" : "concatenate_5_output,p_re_lu_15_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_4",
      "top" : "add_4_output",
      "type" : "elementwise",
      "name" : "add_4",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_16_output",
      "K" : 48,
      "blob_biases" : 99,
      "name" : "conv2d_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "add_4_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 101
    },
    {
      "bottom" : "batch_normalization_16_output",
      "weights" : {
        "params_prelu" : 103
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_16",
      "top" : "p_re_lu_16_output",
      "type" : "activation",
      "name" : "p_re_lu_16"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_14",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_17_output",
      "K" : 24,
      "blob_biases" : 105,
      "name" : "conv2d_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "p_re_lu_16_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "bottom" : "batch_normalization_17_output",
      "weights" : {
        "params_prelu" : 109
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_17",
      "top" : "p_re_lu_17_output",
      "type" : "activation",
      "name" : "p_re_lu_17"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_15",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_18_output",
      "K" : 24,
      "blob_biases" : 111,
      "name" : "conv2d_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "p_re_lu_17_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 113
    },
    {
      "bottom" : "batch_normalization_18_output",
      "weights" : {
        "params_prelu" : 115
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_18",
      "top" : "p_re_lu_18_output",
      "type" : "activation",
      "name" : "p_re_lu_18"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_19_output",
      "K" : 4,
      "blob_biases" : 117,
      "name" : "conv2d_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "p_re_lu_18_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "batch_normalization_19_output",
      "weights" : {
        "params_prelu" : 121
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_19",
      "top" : "p_re_lu_19_output",
      "type" : "activation",
      "name" : "p_re_lu_19"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_6",
      "top" : "concatenate_6_output",
      "type" : "concat",
      "name" : "concatenate_6",
      "bottom" : "p_re_lu_16_output,p_re_lu_19_output"
    },
    {
      "top" : "up_sampling2d_1_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "concatenate_6_output",
      "debug_info" : "up_sampling2d_1",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_1",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_17",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_17_output",
      "K" : 40,
      "blob_biases" : 123,
      "name" : "conv2d_17",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "up_sampling2d_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 125
    },
    {
      "bottom" : "p_re_lu_8_output,conv2d_17_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_5",
      "top" : "add_5_output",
      "type" : "elementwise",
      "name" : "add_5",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_20_output",
      "K" : 8,
      "blob_biases" : 127,
      "name" : "depthwise_conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "add_5_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 129
    },
    {
      "bottom" : "batch_normalization_20_output",
      "weights" : {
        "params_prelu" : 131
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_20",
      "top" : "p_re_lu_20_output",
      "type" : "activation",
      "name" : "p_re_lu_20"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_21_output",
      "K" : 8,
      "blob_biases" : 133,
      "name" : "depthwise_conv2d_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "p_re_lu_20_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "bottom" : "batch_normalization_21_output",
      "weights" : {
        "params_prelu" : 137
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_21",
      "top" : "p_re_lu_21_output",
      "type" : "activation",
      "name" : "p_re_lu_21"
    },
    {
      "bottom" : "add_5_output,p_re_lu_21_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_6",
      "top" : "add_6_output",
      "type" : "elementwise",
      "name" : "add_6",
      "beta" : 0
    },
    {
      "top" : "up_sampling2d_2_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "add_6_output",
      "debug_info" : "up_sampling2d_2",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_2",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_18",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_18_output",
      "K" : 24,
      "blob_biases" : 139,
      "name" : "conv2d_18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "max_pooling2d_1_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 141
    },
    {
      "bottom" : "up_sampling2d_2_output,conv2d_18_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_7",
      "top" : "add_7_output",
      "type" : "elementwise",
      "name" : "add_7",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_19",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_22_output",
      "K" : 8,
      "blob_biases" : 143,
      "name" : "conv2d_19",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "add_7_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 145
    },
    {
      "bottom" : "batch_normalization_22_output",
      "weights" : {
        "params_prelu" : 147
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_22",
      "top" : "p_re_lu_22_output",
      "type" : "activation",
      "name" : "p_re_lu_22"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_7",
      "top" : "concatenate_7_output",
      "type" : "concat",
      "name" : "concatenate_7",
      "bottom" : "add_7_output,p_re_lu_22_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_23_output",
      "K" : 32,
      "blob_biases" : 149,
      "name" : "depthwise_conv2d_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "concatenate_7_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "bottom" : "batch_normalization_23_output",
      "weights" : {
        "params_prelu" : 153
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_23",
      "top" : "p_re_lu_23_output",
      "type" : "activation",
      "name" : "p_re_lu_23"
    },
    {
      "bottom" : "concatenate_7_output,p_re_lu_23_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_8",
      "top" : "add_8_output",
      "type" : "elementwise",
      "name" : "add_8",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_24_output",
      "K" : 32,
      "blob_biases" : 155,
      "name" : "conv2d_20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "add_8_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 157
    },
    {
      "bottom" : "batch_normalization_24_output",
      "weights" : {
        "params_prelu" : 159
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_24",
      "top" : "p_re_lu_24_output",
      "type" : "activation",
      "name" : "p_re_lu_24"
    },
    {
      "top" : "up_sampling2d_3_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "p_re_lu_24_output",
      "debug_info" : "up_sampling2d_3",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_3",
      "scaling_factor_y" : 2
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_8",
      "top" : "concatenate_8_output",
      "type" : "concat",
      "name" : "concatenate_8",
      "bottom" : "p_re_lu_3_output,up_sampling2d_3_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "depthwise_conv2d_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_25_output",
      "K" : 24,
      "blob_biases" : 161,
      "name" : "depthwise_conv2d_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "concatenate_8_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "bottom" : "batch_normalization_25_output",
      "weights" : {
        "params_prelu" : 165
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_25",
      "top" : "p_re_lu_25_output",
      "type" : "activation",
      "name" : "p_re_lu_25"
    },
    {
      "top" : "up_sampling2d_4_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "p_re_lu_25_output",
      "debug_info" : "up_sampling2d_4",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_4",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_21",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_normalization_26_output",
      "K" : 24,
      "blob_biases" : 167,
      "name" : "conv2d_21",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "up_sampling2d_4_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 169
    },
    {
      "bottom" : "batch_normalization_26_output",
      "weights" : {
        "params_prelu" : 171
      },
      "mode" : 4,
      "debug_info" : "p_re_lu_26",
      "top" : "p_re_lu_26_output",
      "type" : "activation",
      "name" : "p_re_lu_26"
    },
    {
      "weights" : {

      },
      "debug_info" : "concatenate_9",
      "top" : "concatenate_9_output",
      "type" : "concat",
      "name" : "concatenate_9",
      "bottom" : "up_sampling2d_4_output,p_re_lu_26_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_22",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_22__activation___output",
      "K" : 32,
      "blob_biases" : 173,
      "name" : "conv2d_22",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "concatenate_9_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 175
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_23_output",
      "K" : 1,
      "blob_biases" : 177,
      "name" : "conv2d_23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "conv2d_22__activation___output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "bottom" : "conv2d_23_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "output",
      "top" : "output1",
      "type" : "activation",
      "name" : "output",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}