{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "name" : "input0.3",
      "weights" : {

      },
      "dst_w" : 128,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 96,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "input",
      "debug_info" : "input0.3",
      "dst_seq" : 1,
      "dst_k" : 3,
      "top" : "input0.3"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.33",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "input.33",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "input.33",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input0.3",
      "weights" : {

      },
      "Nx" : 6,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 6,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "bottom" : "input.33",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "76__silu_sigmoid__",
      "top" : "76__silu_sigmoid__",
      "type" : "activation",
      "name" : "76__silu_sigmoid__"
    },
    {
      "bottom" : "input.33,76__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "76",
      "top" : "76",
      "type" : "elementwise",
      "name" : "76",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.31",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.31",
      "K" : 16,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "input.31",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "76",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "bottom" : "input.31",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "85__silu_sigmoid__",
      "top" : "85__silu_sigmoid__",
      "type" : "activation",
      "name" : "85__silu_sigmoid__"
    },
    {
      "bottom" : "input.31,85__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "85",
      "top" : "85",
      "type" : "elementwise",
      "name" : "85",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.13",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "input.13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "85",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "bottom" : "input.13",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "98__silu_sigmoid__",
      "top" : "98__silu_sigmoid__",
      "type" : "activation",
      "name" : "98__silu_sigmoid__"
    },
    {
      "bottom" : "input.13,98__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "98",
      "top" : "98",
      "type" : "elementwise",
      "name" : "98",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.15",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.15",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "input.15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "98",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "bottom" : "input.15",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "110__silu_sigmoid__",
      "top" : "110__silu_sigmoid__",
      "type" : "activation",
      "name" : "110__silu_sigmoid__"
    },
    {
      "bottom" : "input.15,110__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "110",
      "top" : "110",
      "type" : "elementwise",
      "name" : "110",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.17",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.17",
      "K" : 16,
      "blob_biases" : 17,
      "name" : "input.17",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "110",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "bottom" : "input.17",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "119__silu_sigmoid__",
      "top" : "119__silu_sigmoid__",
      "type" : "activation",
      "name" : "119__silu_sigmoid__"
    },
    {
      "bottom" : "input.17,119__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "119",
      "top" : "119",
      "type" : "elementwise",
      "name" : "119",
      "beta" : 0
    },
    {
      "bottom" : "98,119",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "120",
      "top" : "120",
      "type" : "elementwise",
      "name" : "120",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.11",
      "K" : 32,
      "blob_biases" : 21,
      "name" : "input.11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "85",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "bottom" : "input.11",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "129__silu_sigmoid__",
      "top" : "129__silu_sigmoid__",
      "type" : "activation",
      "name" : "129__silu_sigmoid__"
    },
    {
      "bottom" : "input.11,129__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "129",
      "top" : "129",
      "type" : "elementwise",
      "name" : "129",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.21",
      "top" : "input.21",
      "type" : "concat",
      "name" : "input.21",
      "bottom" : "120,129"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.2",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "input0.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.21",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "bottom" : "input0.2",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "140__silu_sigmoid__",
      "top" : "140__silu_sigmoid__",
      "type" : "activation",
      "name" : "140__silu_sigmoid__"
    },
    {
      "bottom" : "input0.2,140__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "140",
      "top" : "140",
      "type" : "elementwise",
      "name" : "140",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.19",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.19",
      "K" : 32,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "input.19",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "140",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "bottom" : "input.19",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "149__silu_sigmoid__",
      "top" : "149__silu_sigmoid__",
      "type" : "activation",
      "name" : "149__silu_sigmoid__"
    },
    {
      "bottom" : "input.19,149__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "149",
      "top" : "149",
      "type" : "elementwise",
      "name" : "149",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.25",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.25",
      "K" : 64,
      "blob_biases" : 33,
      "name" : "input.25",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "149",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "bottom" : "input.25",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "162__silu_sigmoid__",
      "top" : "162__silu_sigmoid__",
      "type" : "activation",
      "name" : "162__silu_sigmoid__"
    },
    {
      "bottom" : "input.25,162__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "162",
      "top" : "162",
      "type" : "elementwise",
      "name" : "162",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.27",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.27",
      "K" : 32,
      "blob_biases" : 37,
      "name" : "input.27",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "162",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "bottom" : "input.27",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "175__silu_sigmoid__",
      "top" : "175__silu_sigmoid__",
      "type" : "activation",
      "name" : "175__silu_sigmoid__"
    },
    {
      "bottom" : "input.27,175__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "175",
      "top" : "175",
      "type" : "elementwise",
      "name" : "175",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.29",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.29",
      "K" : 32,
      "blob_biases" : 41,
      "name" : "input.29",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "175",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "bottom" : "input.29",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "184__silu_sigmoid__",
      "top" : "184__silu_sigmoid__",
      "type" : "activation",
      "name" : "184__silu_sigmoid__"
    },
    {
      "bottom" : "input.29,184__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "184",
      "top" : "184",
      "type" : "elementwise",
      "name" : "184",
      "beta" : 0
    },
    {
      "bottom" : "162,184",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "185",
      "top" : "185",
      "type" : "elementwise",
      "name" : "185",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.35",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.35",
      "K" : 32,
      "blob_biases" : 45,
      "name" : "input.35",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "185",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "bottom" : "input.35",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "196__silu_sigmoid__",
      "top" : "196__silu_sigmoid__",
      "type" : "activation",
      "name" : "196__silu_sigmoid__"
    },
    {
      "bottom" : "input.35,196__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "196",
      "top" : "196",
      "type" : "elementwise",
      "name" : "196",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.37",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.37",
      "K" : 32,
      "blob_biases" : 49,
      "name" : "input.37",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "196",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "bottom" : "input.37",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "205__silu_sigmoid__",
      "top" : "205__silu_sigmoid__",
      "type" : "activation",
      "name" : "205__silu_sigmoid__"
    },
    {
      "bottom" : "input.37,205__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "205",
      "top" : "205",
      "type" : "elementwise",
      "name" : "205",
      "beta" : 0
    },
    {
      "bottom" : "185,205",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "206",
      "top" : "206",
      "type" : "elementwise",
      "name" : "206",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.23",
      "K" : 64,
      "blob_biases" : 53,
      "name" : "input.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "149",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "bottom" : "input.23",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "215__silu_sigmoid__",
      "top" : "215__silu_sigmoid__",
      "type" : "activation",
      "name" : "215__silu_sigmoid__"
    },
    {
      "bottom" : "input.23,215__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "215",
      "top" : "215",
      "type" : "elementwise",
      "name" : "215",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.41",
      "top" : "input.41",
      "type" : "concat",
      "name" : "input.41",
      "bottom" : "206,215"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.4",
      "K" : 64,
      "blob_biases" : 57,
      "name" : "input0.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.41",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "input0.4",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "226__silu_sigmoid__",
      "top" : "226__silu_sigmoid__",
      "type" : "activation",
      "name" : "226__silu_sigmoid__"
    },
    {
      "bottom" : "input0.4,226__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "226",
      "top" : "226",
      "type" : "elementwise",
      "name" : "226",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.39",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.39",
      "K" : 64,
      "blob_biases" : 61,
      "stride_x" : 2,
      "name" : "input.39",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "226",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "bottom" : "input.39",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "235__silu_sigmoid__",
      "top" : "235__silu_sigmoid__",
      "type" : "activation",
      "name" : "235__silu_sigmoid__"
    },
    {
      "bottom" : "input.39,235__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "235",
      "top" : "235",
      "type" : "elementwise",
      "name" : "235",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.45",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.45",
      "K" : 128,
      "blob_biases" : 65,
      "name" : "input.45",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "235",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "bottom" : "input.45",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "248__silu_sigmoid__",
      "top" : "248__silu_sigmoid__",
      "type" : "activation",
      "name" : "248__silu_sigmoid__"
    },
    {
      "bottom" : "input.45,248__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "248",
      "top" : "248",
      "type" : "elementwise",
      "name" : "248",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.3",
      "K" : 64,
      "blob_biases" : 69,
      "name" : "input.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "248",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "bottom" : "input.3",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "262__silu_sigmoid__",
      "top" : "262__silu_sigmoid__",
      "type" : "activation",
      "name" : "262__silu_sigmoid__"
    },
    {
      "bottom" : "input.3,262__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "262",
      "top" : "262",
      "type" : "elementwise",
      "name" : "262",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.5",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.5",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "input.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "262",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "bottom" : "input.5",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "271__silu_sigmoid__",
      "top" : "271__silu_sigmoid__",
      "type" : "activation",
      "name" : "271__silu_sigmoid__"
    },
    {
      "bottom" : "input.5,271__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "271",
      "top" : "271",
      "type" : "elementwise",
      "name" : "271",
      "beta" : 0
    },
    {
      "bottom" : "248,271",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "272",
      "top" : "272",
      "type" : "elementwise",
      "name" : "272",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.7",
      "K" : 64,
      "blob_biases" : 77,
      "name" : "input.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "272",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "bottom" : "input.7",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "283__silu_sigmoid__",
      "top" : "283__silu_sigmoid__",
      "type" : "activation",
      "name" : "283__silu_sigmoid__"
    },
    {
      "bottom" : "input.7,283__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "283",
      "top" : "283",
      "type" : "elementwise",
      "name" : "283",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.9",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.9",
      "K" : 64,
      "blob_biases" : 81,
      "name" : "input.9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "283",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "input.9",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "292__silu_sigmoid__",
      "top" : "292__silu_sigmoid__",
      "type" : "activation",
      "name" : "292__silu_sigmoid__"
    },
    {
      "bottom" : "input.9,292__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "292",
      "top" : "292",
      "type" : "elementwise",
      "name" : "292",
      "beta" : 0
    },
    {
      "bottom" : "272,292",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "293",
      "top" : "293",
      "type" : "elementwise",
      "name" : "293",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.47",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.47",
      "K" : 64,
      "blob_biases" : 85,
      "name" : "input.47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "293",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "bottom" : "input.47",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "304__silu_sigmoid__",
      "top" : "304__silu_sigmoid__",
      "type" : "activation",
      "name" : "304__silu_sigmoid__"
    },
    {
      "bottom" : "input.47,304__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "304",
      "top" : "304",
      "type" : "elementwise",
      "name" : "304",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.49",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.49",
      "K" : 64,
      "blob_biases" : 89,
      "name" : "input.49",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "304",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "bottom" : "input.49",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "313__silu_sigmoid__",
      "top" : "313__silu_sigmoid__",
      "type" : "activation",
      "name" : "313__silu_sigmoid__"
    },
    {
      "bottom" : "input.49,313__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "313",
      "top" : "313",
      "type" : "elementwise",
      "name" : "313",
      "beta" : 0
    },
    {
      "bottom" : "293,313",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "314",
      "top" : "314",
      "type" : "elementwise",
      "name" : "314",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.43",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.43",
      "K" : 128,
      "blob_biases" : 93,
      "name" : "input.43",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "235",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "bottom" : "input.43",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "323__silu_sigmoid__",
      "top" : "323__silu_sigmoid__",
      "type" : "activation",
      "name" : "323__silu_sigmoid__"
    },
    {
      "bottom" : "input.43,323__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "323",
      "top" : "323",
      "type" : "elementwise",
      "name" : "323",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.53",
      "top" : "input.53",
      "type" : "concat",
      "name" : "input.53",
      "bottom" : "314,323"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.6",
      "K" : 128,
      "blob_biases" : 97,
      "name" : "input0.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.53",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "bottom" : "input0.6",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "334__silu_sigmoid__",
      "top" : "334__silu_sigmoid__",
      "type" : "activation",
      "name" : "334__silu_sigmoid__"
    },
    {
      "bottom" : "input0.6,334__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "334",
      "top" : "334",
      "type" : "elementwise",
      "name" : "334",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.51",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.51",
      "K" : 128,
      "blob_biases" : 101,
      "stride_x" : 2,
      "name" : "input.51",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "334",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "bottom" : "input.51",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "343__silu_sigmoid__",
      "top" : "343__silu_sigmoid__",
      "type" : "activation",
      "name" : "343__silu_sigmoid__"
    },
    {
      "bottom" : "input.51,343__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "343",
      "top" : "343",
      "type" : "elementwise",
      "name" : "343",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.57",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.57",
      "K" : 256,
      "blob_biases" : 105,
      "name" : "input.57",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "343",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "bottom" : "input.57",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "356__silu_sigmoid__",
      "top" : "356__silu_sigmoid__",
      "type" : "activation",
      "name" : "356__silu_sigmoid__"
    },
    {
      "bottom" : "input.57,356__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "356",
      "top" : "356",
      "type" : "elementwise",
      "name" : "356",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.61",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.61",
      "K" : 128,
      "blob_biases" : 109,
      "name" : "input.61",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "356",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "bottom" : "input.61",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "368__silu_sigmoid__",
      "top" : "368__silu_sigmoid__",
      "type" : "activation",
      "name" : "368__silu_sigmoid__"
    },
    {
      "bottom" : "input.61,368__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "368",
      "top" : "368",
      "type" : "elementwise",
      "name" : "368",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.71",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.71",
      "K" : 128,
      "blob_biases" : 113,
      "name" : "input.71",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "368",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "bottom" : "input.71",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "377__silu_sigmoid__",
      "top" : "377__silu_sigmoid__",
      "type" : "activation",
      "name" : "377__silu_sigmoid__"
    },
    {
      "bottom" : "input.71,377__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "377",
      "top" : "377",
      "type" : "elementwise",
      "name" : "377",
      "beta" : 0
    },
    {
      "bottom" : "356,377",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "378",
      "top" : "378",
      "type" : "elementwise",
      "name" : "378",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.59",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.59",
      "K" : 256,
      "blob_biases" : 117,
      "name" : "input.59",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "343",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "bottom" : "input.59",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "387__silu_sigmoid__",
      "top" : "387__silu_sigmoid__",
      "type" : "activation",
      "name" : "387__silu_sigmoid__"
    },
    {
      "bottom" : "input.59,387__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "387",
      "top" : "387",
      "type" : "elementwise",
      "name" : "387",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.55",
      "top" : "input.55",
      "type" : "concat",
      "name" : "input.55",
      "bottom" : "378,387"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.8",
      "K" : 256,
      "blob_biases" : 121,
      "name" : "input0.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.55",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "bottom" : "input0.8",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "398__silu_sigmoid__",
      "top" : "398__silu_sigmoid__",
      "type" : "activation",
      "name" : "398__silu_sigmoid__"
    },
    {
      "bottom" : "input0.8,398__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "398",
      "top" : "398",
      "type" : "elementwise",
      "name" : "398",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.75",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.75",
      "K" : 256,
      "blob_biases" : 125,
      "name" : "input.75",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "398",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "bottom" : "input.75",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "409__silu_sigmoid__",
      "top" : "409__silu_sigmoid__",
      "type" : "activation",
      "name" : "409__silu_sigmoid__"
    },
    {
      "bottom" : "input.75,409__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "409",
      "top" : "409",
      "type" : "elementwise",
      "name" : "409",
      "beta" : 0
    },
    {
      "pad_r" : 2,
      "debug_info" : "input.67",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "size_x" : 5,
      "top" : "input.67",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.67",
      "pad_t" : 2,
      "stride_y" : 1,
      "bottom" : "409",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "pad_r" : 2,
      "debug_info" : "input.63",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "size_x" : 5,
      "top" : "input.63",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.63",
      "pad_t" : 2,
      "stride_y" : 1,
      "bottom" : "input.67",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "pad_r" : 2,
      "debug_info" : "424",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "size_x" : 5,
      "top" : "424",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "424",
      "pad_t" : 2,
      "stride_y" : 1,
      "bottom" : "input.63",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.69",
      "top" : "input.69",
      "type" : "concat",
      "name" : "input.69",
      "bottom" : "409,input.67,input.63,424"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.10",
      "K" : 512,
      "blob_biases" : 129,
      "name" : "input0.10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.69",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "bottom" : "input0.10",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "435__silu_sigmoid__",
      "top" : "435__silu_sigmoid__",
      "type" : "activation",
      "name" : "435__silu_sigmoid__"
    },
    {
      "bottom" : "input0.10,435__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "435",
      "top" : "435",
      "type" : "elementwise",
      "name" : "435",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.65",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.65",
      "K" : 256,
      "blob_biases" : 133,
      "name" : "input.65",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "435",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "bottom" : "input.65",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "444__silu_sigmoid__",
      "top" : "444__silu_sigmoid__",
      "type" : "activation",
      "name" : "444__silu_sigmoid__"
    },
    {
      "bottom" : "input.65,444__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "444",
      "top" : "444",
      "type" : "elementwise",
      "name" : "444",
      "beta" : 0
    },
    {
      "top" : "446",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "444",
      "debug_info" : "446",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "446",
      "scaling_factor_y" : 2
    },
    {
      "weights" : {

      },
      "debug_info" : "input.73",
      "top" : "input.73",
      "type" : "concat",
      "name" : "input.73",
      "bottom" : "446,334"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.81",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.81",
      "K" : 256,
      "blob_biases" : 137,
      "name" : "input.81",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.73",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "bottom" : "input.81",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "461__silu_sigmoid__",
      "top" : "461__silu_sigmoid__",
      "type" : "activation",
      "name" : "461__silu_sigmoid__"
    },
    {
      "bottom" : "input.81,461__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "461",
      "top" : "461",
      "type" : "elementwise",
      "name" : "461",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.83",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.83",
      "K" : 64,
      "blob_biases" : 141,
      "name" : "input.83",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "461",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "bottom" : "input.83",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "473__silu_sigmoid__",
      "top" : "473__silu_sigmoid__",
      "type" : "activation",
      "name" : "473__silu_sigmoid__"
    },
    {
      "bottom" : "input.83,473__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "473",
      "top" : "473",
      "type" : "elementwise",
      "name" : "473",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.85",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.85",
      "K" : 64,
      "blob_biases" : 145,
      "name" : "input.85",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "473",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "input.85",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "482__silu_sigmoid__",
      "top" : "482__silu_sigmoid__",
      "type" : "activation",
      "name" : "482__silu_sigmoid__"
    },
    {
      "bottom" : "input.85,482__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "482",
      "top" : "482",
      "type" : "elementwise",
      "name" : "482",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.77",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.77",
      "K" : 256,
      "blob_biases" : 149,
      "name" : "input.77",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.73",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "bottom" : "input.77",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "491__silu_sigmoid__",
      "top" : "491__silu_sigmoid__",
      "type" : "activation",
      "name" : "491__silu_sigmoid__"
    },
    {
      "bottom" : "input.77,491__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "491",
      "top" : "491",
      "type" : "elementwise",
      "name" : "491",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.89",
      "top" : "input.89",
      "type" : "concat",
      "name" : "input.89",
      "bottom" : "482,491"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input0.12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input0.12",
      "K" : 128,
      "blob_biases" : 153,
      "name" : "input0.12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.89",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "bottom" : "input0.12",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "502__silu_sigmoid__",
      "top" : "502__silu_sigmoid__",
      "type" : "activation",
      "name" : "502__silu_sigmoid__"
    },
    {
      "bottom" : "input0.12,502__silu_sigmoid__",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "502",
      "top" : "502",
      "type" : "elementwise",
      "name" : "502",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.79",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.79",
      "K" : 128,
      "blob_biases" : 157,
      "name" : "input.79",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "502",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "bottom" : "input.79",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "511__silu_sigmoid__",
      "top" : "511__silu_sigmoid__",
      "type" : "activation",
      "name" : "511__silu_sigmoid__"
    },
    {
      "bottom" : "input.79,511__silu_sigmoid__",
