{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_downs_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_19_output",
      "K" : 4,
      "blob_biases" : 1,
      "name" : "conv2d_downs_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_9_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_9",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "re_lu_19_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_downs_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_20_output",
      "K" : 8,
      "blob_biases" : 5,
      "name" : "conv2d_downs_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "max_pooling2d_9_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_10_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_10",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "re_lu_20_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_downs_2_1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_downs_2_1_output_intermin_",
      "K" : 16,
      "name" : "sep_conv2d_downs_2_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "max_pooling2d_10_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 9
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_downs_2_1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_21_output",
      "K" : 16,
      "blob_biases" : 11,
      "name" : "sep_conv2d_downs_2_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sep_conv2d_downs_2_1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 13
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_11_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_11",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "re_lu_21_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_down_s0_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_down_s0_output_intermin_",
      "K" : 32,
      "name" : "sep_conv2d_down_s0_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "max_pooling2d_11_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_down_s0_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_22_output",
      "K" : 32,
      "blob_biases" : 17,
      "name" : "sep_conv2d_down_s0_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sep_conv2d_down_s0_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_down_s1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_down_s1_output_intermin_",
      "K" : 64,
      "name" : "sep_conv2d_down_s1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "re_lu_22_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 21
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_down_s1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_23_output",
      "K" : 64,
      "blob_biases" : 23,
      "name" : "sep_conv2d_down_s1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sep_conv2d_down_s1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 25
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_down_s2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_down_s2_output_intermin_",
      "K" : 64,
      "name" : "sep_conv2d_down_s2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "re_lu_23_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_down_s2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_24_output",
      "K" : 64,
      "blob_biases" : 29,
      "name" : "sep_conv2d_down_s2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sep_conv2d_down_s2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_12_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_12",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "re_lu_24_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "max_pooling2d_12_output",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 0,
      "debug_info" : "flatten1",
      "top" : "flatten1_output",
      "type" : "flatten",
      "name" : "flatten1"
    },
    {
      "nB" : 2304,
      "top" : "dense128_s_output",
      "has_biases" : 1,
      "blob_weights_f16" : 35,
      "nC" : 128,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "flatten1_output",
      "blob_biases" : 33,
      "has_tanh" : 0,
      "debug_info" : "dense128_s",
      "name" : "dense128_s",
      "has_prelu" : 0
    },
    {
      "nB" : 128,
      "top" : "dense2304_s_output",
      "has_biases" : 1,
      "blob_weights_f16" : 39,
      "nC" : 2304,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense128_s_output",
      "blob_biases" : 37,
      "has_tanh" : 0,
      "debug_info" : "dense2304_s",
      "name" : "dense2304_s",
      "has_prelu" : 0
    },
    {
      "name" : "reshape_3",
      "weights" : {

      },
      "dst_w" : 6,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 6,
      "mode" : 1,
      "bottom" : "dense2304_s_output",
      "debug_info" : "reshape_3",
      "dst_seq" : 1,
      "dst_k" : 64,
      "top" : "reshape_3_output"
    },
    {
      "bottom" : "reshape_3_output",
      "target_size_w" : 12,
      "spatial_scale" : 1,
      "weights" : {

      },
      "grid_sampling_mode" : 1,
      "debug_info" : "up_sampling2d_1",
      "target_size_h" : 12,
      "top" : "up_sampling2d_1_output",
      "type" : "crop_and_resize",
      "name" : "up_sampling2d_1",
      "crop_index_mode" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_up_s0_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_up_s0_output_intermin_",
      "K" : 64,
      "name" : "sep_conv2d_up_s0_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "up_sampling2d_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 41
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_up_s0_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_25_output",
      "K" : 64,
      "blob_biases" : 43,
      "name" : "sep_conv2d_up_s0_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sep_conv2d_up_s0_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 45
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_up_s1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_up_s1_output_intermin_",
      "K" : 64,
      "name" : "sep_conv2d_up_s1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "re_lu_25_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_up_s1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_26_output",
      "K" : 64,
      "blob_biases" : 49,
      "name" : "sep_conv2d_up_s1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sep_conv2d_up_s1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_up_s2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_up_s2_output_intermin_",
      "K" : 64,
      "name" : "sep_conv2d_up_s2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "re_lu_26_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 53
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_up_s2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_27_output",
      "K" : 64,
      "blob_biases" : 55,
      "name" : "sep_conv2d_up_s2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "sep_conv2d_up_s2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 57
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_ups_0_1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_ups_0_1_output_intermin_",
      "K" : 64,
      "name" : "sep_conv2d_ups_0_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "re_lu_27_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_ups_0_1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_28_output",
      "K" : 64,
      "blob_biases" : 61,
      "name" : "sep_conv2d_ups_0_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sep_conv2d_ups_0_1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "bottom" : "re_lu_28_output",
      "target_size_w" : 24,
      "spatial_scale" : 1,
      "weights" : {

      },
      "grid_sampling_mode" : 1,
      "debug_info" : "up_sampling2d_2",
      "target_size_h" : 24,
      "top" : "up_sampling2d_2_output",
      "type" : "crop_and_resize",
      "name" : "up_sampling2d_2",
      "crop_index_mode" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_ups_1_1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sep_conv2d_ups_1_1_output_intermin_",
      "K" : 32,
      "name" : "sep_conv2d_ups_1_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "up_sampling2d_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 65
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sep_conv2d_ups_1_1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_29_output",
      "K" : 32,
      "blob_biases" : 67,
      "name" : "sep_conv2d_ups_1_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "sep_conv2d_ups_1_1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 69
    },
    {
      "bottom" : "re_lu_29_output",
      "target_size_w" : 48,
      "spatial_scale" : 1,
      "weights" : {

      },
      "grid_sampling_mode" : 1,
      "debug_info" : "up_sampling2d_3",
      "target_size_h" : 48,
      "top" : "up_sampling2d_3_output",
      "type" : "crop_and_resize",
      "name" : "up_sampling2d_3",
      "crop_index_mode" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_ups_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "re_lu_30_output",
      "K" : 16,
      "blob_biases" : 71,
      "name" : "conv2d_ups_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "up_sampling2d_3_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 73
    },
    {
      "bottom" : "re_lu_30_output",
      "target_size_w" : 96,
      "spatial_scale" : 1,
      "weights" : {

      },
      "grid_sampling_mode" : 1,
      "debug_info" : "up_sampling2d_4",
      "target_size_h" : 96,
      "top" : "up_sampling2d_4_output",
      "type" : "crop_and_resize",
      "name" : "up_sampling2d_4",
      "crop_index_mode" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "finalConv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "finalConv_output",
      "K" : 8,
      "blob_biases" : 75,
      "name" : "finalConv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "up_sampling2d_4_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 77
    },
    {
      "bottom" : "finalConv_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "activation_1",
      "top" : "output1",
      "type" : "activation",
      "name" : "activation_1",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}